#+NAME: read.table
#+BEGIN_SRC R

    df = read.table(THEFILE, header = TRUE, fill = TRUE, sep = ",")
  dim(df)
  class(df)
  names(df)

#+END_SRC

#+RESULTS: 
#+BEGIN_EXAMPLE
[1] 2175   85
[1] "data.frame"
 [1] "Reg.No"              "CNO"                 "Cname"              
 [4] "Con.Case"            "ID"                  "Gender"             
 [7] "Birthday"            "Seq.Cancer"          "Diag.Age"           
[10] "Ini.Diag.Date"       "Pat.Diag.Date"       "Diag.Confirm"       
[13] "Primary.Site"        "Laterality"          "Histolog"           
[16] "Behavior"            "Grade"               "Tumor.Size.C"       
[19] "Tumor.Size.P"        "Nodes.Exam"          "Nodes.Positive"     
[22] "Margin.Distance"     "Surgical.Margins"    "TNM.Edition"        
[25] "T.C.T"               "T.C.N"               "T.C.M"              
[28] "TNM.C.GROUP"         "T.P.T"               "T.P.N"              
[31] "T.P.M"               "TNM.P.GROUP"         "Other.Staging"      
[34] "Other.Staging.C"     "Other.Staging.P"     "Tumor.Marker.ER"    
[37] "Tumor.Marker.PR"     "Surgery"             "Type.of.Surgery"    
[40] "Regional.Ln.Surgery" "Ln.Surgical.Scope"   "Surgery.Date"       
[43] "RT"                  "RT.Type"             "RT.Dose"            
[46] "RT.No"               "RT.S.DATE"           "RT.E.DATE"          
[49] "BRT"                 "BRT.Dose"            "Chemo"              
[52] "Con.Current.C.R"     "Chemo.type"          "Chemo.Cycles"       
[55] "Chemo.Date"          "Hormome"             "Hormome.Date"       
[58] "TACE"                "TACE.Cycles"         "TACE.Date"          
[61] "Concate.Date"        "Carry.Status"        "Disease.Condition"  
[64] "relapse.Date"        "relapse.site"        "Distance.Site1"     
[67] "Ds.Date1"            "Distance.Site2"      "Ds.Date2"           
[70] "Distance.Site3"      "Ds.Date3"            "NDistance.Site1"    
[73] "NDs.Date1"           "NDistance.Site2"     "NDs.Date2"          
[76] "NDistance.Site3"     "NDs.Date3"           "relapse.site1"      
[79] "relapse.DATE1"       "relapse.site2"       "relapse.DATE2"      
[82] "relapse.site3"       "relapse.DATE3"       "Death.Detail"       
[85] "Death"
#+END_EXAMPLE
